
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = ЖЧТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("ЗаполнитьПараметрыЗапроса")
			.ДобавитьТест("Тест_ЗаполнитьПараметрыЗапроса")
		.ДобавитьТестовыйНабор("ДобавитьТаблицуВМенеджерВременныхТаблиц")
			.ДобавитьТест("Тест_ДобавитьТаблицуВМенеджерВременныхТаблиц")
	;

КонецПроцедуры

#Область Тесты

#Область ЗаполнитьПараметрыЗапроса

Процедура Тест_ЗаполнитьПараметрыЗапроса() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	Запрос = Новый Запрос("ВЫБРАТЬ &П1, &П2, &П4");
	Параметры = Новый Структура("П1,П3,П4,П5");
	
	ТестируемыйМодуль.ЗаполнитьПараметрыЗапроса(Запрос, Параметры);
	
	ЮТест.ОжидаетЧто(Запрос.Параметры)
		.ИмеетСвойство("П1")
		.НеИмеетСвойства("П2")
		.НеИмеетСвойства("П3")
		.ИмеетСвойство("П4")
		.НеИмеетСвойства("П5");
	
КонецПроцедуры

#КонецОбласти

#Область ДобавитьТаблицуВМенеджерВременныхТаблиц

Процедура Тест_ДобавитьТаблицуВМенеджерВременныхТаблиц() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	МВТ = Новый МенеджерВременныхТаблиц();
	ТЗ = Новый ТаблицаЗначений();
	ТЗ.Колонки.Добавить("К1", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("К2", Новый ОписаниеТипов("Строка"));
	ТЗ.Колонки.Добавить("К3", Новый ОписаниеТипов("Дата"));
	
	ИмяТаблицы = "Тест";
	ТестируемыйМодуль.ДобавитьТаблицуВМенеджерВременныхТаблиц(МВТ, "Тест", ТЗ);
	
	ВТ = МВТ.Таблицы.Найти("Тест");
	ЮТест.ОжидаетЧто(ВТ).ИмеетТип(Тип("ВременнаяТаблицаЗапроса"))
		.Свойство("ПолноеИмя").Равно(ИмяТаблицы)
		.Свойство("Колонки").ИмеетДлину(ТЗ.Колонки.Количество());
	
	Для Каждого Колонка Из ВТ.Колонки Цикл
		ЮТест.ОжидаетЧто(Колонка.ТипЗначения).Равно(ТЗ.Колонки[Колонка.Имя].ТипЗначения);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль() Экспорт

	Возврат ЖЧТ_Модули.РаботаСЗапросами();
	
КонецФункции

#КонецОбласти
