
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = ЖЧТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("ЗаполнитьПараметрыЗапроса")
			.ДобавитьТест("Тест_ЗаполнитьПараметрыЗапроса")
	;

КонецПроцедуры

#Область Тесты

#Область ЗаполнитьПараметрыЗапроса

Процедура Тест_ЗаполнитьПараметрыЗапроса() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	Запрос = Новый Запрос("ВЫБРАТЬ &П1, &П2, &П4");
	Параметры = Новый Структура("П1,П3,П4,П5");
	
	ТестируемыйМодуль.ЗаполнитьПараметрыЗапроса(Запрос, Параметры);
	
	ЮТест.ОжидаетЧто(Запрос.Параметры)
		.ИмеетСвойство("П1")
		.НеИмеетСвойства("П2")
		.НеИмеетСвойства("П3")
		.ИмеетСвойство("П4")
		.НеИмеетСвойства("П5");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль() Экспорт

	Возврат ЖЧТ_Модули.РаботаСЗапросами();
	
КонецФункции

#КонецОбласти
