
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = ЖЧТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне")
			.ДобавитьКлиентскийТест("Тест_ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне")
		.ДобавитьТестовыйНабор("СтруктураИзПараметровФормы")
			.ДобавитьКлиентскийТест("Тест_СтруктураИзПараметровФормы")
		
	;

КонецПроцедуры

#Область Тесты

#Область ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне

Процедура Тест_ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	ИмяСписка = "Списочек";
	
	МокФормы = Новый Структура();
	МокФормы.Вставить("Окно", Неопределено);
	МокФормы.Вставить("Списочек", Новый Структура);
	МокФормы.Списочек.Вставить("АвтоматическоеСохранениеПользовательскихНастроек", Истина);
	
	ТестируемыйМодуль.ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне(МокФормы, "Списочек");
	ЮТест.ОжидаетЧто(МокФормы.Списочек.АвтоматическоеСохранениеПользовательскихНастроек).ЭтоИстина();
	
	МокФормы.Окно = Новый Структура;
	ТестируемыйМодуль.ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне(МокФормы, "Списочек");
	ЮТест.ОжидаетЧто(МокФормы.Списочек.АвтоматическоеСохранениеПользовательскихНастроек).ЭтоЛожь();
	
КонецПроцедуры

#КонецОбласти

#Область СтруктураИзПараметровФормы

#Если Клиент Тогда

Процедура Тест_СтруктураИзПараметровФормы() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	Ожидаемый = Новый Структура;
	Ожидаемый.Вставить("Число", ЖЧТ_Общее.СлучайноеЧисло(1, 999));
	Ожидаемый.Вставить("Строка", ЖЧТ_Общее.СлучайныйКлюч());
	Ожидаемый.Вставить("Булево", Булево(ЖЧТ_Общее.СлучайноеЧисло(0, 1)));
	Ожидаемый.Вставить("Дата", ТекущаяДата());
	Ожидаемый.Вставить("Произвольный", Новый Структура);
	ИмяКлюча = ЖЧТ_Общее.СлучайныйКлюч();
	Ожидаемый.Произвольный.Вставить(ИмяКлюча, Новый УникальныйИдентификатор());
	
	Форма = ПолучитьФорму("ОбщаяФорма.ЖЧТ_РаботаСФормами", Ожидаемый);
	
	Результат = ТестируемыйМодуль.СтруктураИзПараметровФормы(Форма.Параметры);
	
	ЮТест.ОжидаетЧто(Результат)
		.ИмеетТип("Структура")
		.Свойство("Число").Равно(Ожидаемый.Число)
		.Свойство("Строка").Равно(Ожидаемый.Строка)
		.Свойство("Булево").Равно(Ожидаемый.Булево)
		.Свойство("Дата").Равно(Ожидаемый.Дата)
		.Свойство("Произвольный." + ИмяКлюча).Равно(Ожидаемый.Произвольный[ИмяКлюча])
		;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль() Экспорт

	Возврат ЖЧТ_Модули.РаботаСФормами();
	
КонецФункции

#КонецОбласти