
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = ЖЧТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне")
			.ДобавитьКлиентскийТест("Тест_ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне")
		
	;

КонецПроцедуры

#Область Тесты

#Область ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне

Процедура Тест_ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	ИмяСписка = "Списочек";
	
	МокФормы = Новый Структура();
	МокФормы.Вставить("Окно", Неопределено);
	МокФормы.Вставить("Списочек", Новый Структура);
	МокФормы.Списочек.Вставить("АвтоматическоеСохранениеПользовательскихНастроек", Истина);
	
	ТестируемыйМодуль.ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне(МокФормы, "Списочек");
	ЮТест.ОжидаетЧто(МокФормы.Списочек.АвтоматическоеСохранениеПользовательскихНастроек).ЭтоИстина();
	
	МокФормы.Окно = Новый Структура;
	ТестируемыйМодуль.ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне(МокФормы, "Списочек");
	ЮТест.ОжидаетЧто(МокФормы.Списочек.АвтоматическоеСохранениеПользовательскихНастроек).ЭтоЛожь();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль() Экспорт

	Возврат ЖЧТ_Модули.РаботаСФормами();
	
КонецФункции

#КонецОбласти