// @strict-types

#Область ПрограммныйИнтерфейс

// Заполняет в запросе параметры из структуры (берет только те, что есть в запросе, игнорируя лишние свойства).
// 
// Параметры:
//  Запрос - Запрос
//  ИсточникПараметров - Структура
Процедура ЗаполнитьПараметрыЗапроса(Запрос, ИсточникПараметров) Экспорт
	
	Для Каждого ПараметрЗапроса Из Запрос.НайтиПараметры() Цикл
		
		ИмяПараметра = ПараметрЗапроса.Имя;
		ЗначениеПараметра = Неопределено;
		Если ИсточникПараметров.Свойство(ИмяПараметра, ЗначениеПараметра) Тогда
			Запрос.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
