// @strict-types

#Область ПрограммныйИнтерфейс

// Сколько процентов число от числа
// Источник: https://github.com/SeiOkami/CollectionMethodsOneS/issues/151
// 
// Параметры:
//  Число - Число
//  ОтЧисла - Число
//  ОкруглятьДо - Число - Количество знаков округления, 0 - не требуется
// 
// Возвращаемое значение:
//  Число
//
// Пример:
//  Процент = СколькоПроцентовЧислоОтЧисла(10, 100);  // 10
//  Процент = СколькоПроцентовЧислоОтЧисла(9, 69, 2); // 13.04
//
Функция СколькоПроцентовЧислоОтЧисла(
	Знач Число, Знач ОтЧисла, Знач ОкруглятьДо = 0) Экспорт
	
	Если ОтЧисла = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Результат = (Число / ОтЧисла) * 100;
	
	Если ОкруглятьДо > 0 Тогда
		Результат = Окр(Результат, ОкруглятьДо);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
