// @strict-types

#Область ПрограммныйИнтерфейс

// Сколько процентов число от числа.
// 
// Параметры:
//  Число - Число
//  ОтЧисла - Число
//  ОкруглятьДо - Число - Количество знаков округления, 0 - не требуется
// 
// Возвращаемое значение:
//  Число
Функция СколькоПроцентовЧислоОтЧисла(
	Знач Число, Знач ОтЧисла, Знач ОкруглятьДо = 0) Экспорт
	
	Если ОтЧисла = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Результат = (Число / ОтЧисла) * 100;
	
	Если ОкруглятьДо > 0 Тогда
		Результат = Окр(Результат, ОкруглятьДо);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
