
#Область СлужебныйПрограммныйИнтерфейс

// Фейковая ссылка.
// 
// Параметры:
//  ИмяТипа - Строка
// 
// Возвращаемое значение:
//  ЛюбаяСсылка
Функция ФейковаяСсылка(ИмяТипа) Экспорт
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый УникальныйИдентификатор());
	
	Возврат Новый (ИмяТипа, Параметры);
	
КонецФункции

// Сортированный массив.
// 
// Параметры:
//  Массив - Массив из Произвольный
// 
// Возвращаемое значение:
//  Массив из Произвольный
Функция СортированныйМассив(Массив) Экспорт
	
	Список = Новый СписокЗначений();
	Список.ЗагрузитьЗначения(Массив);
	Список.СортироватьПоЗначению();
	Возврат Список.ВыгрузитьЗначения();
	
КонецФункции

#КонецОбласти
