
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = ЖЧТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("НовыйОбъект")
			.ДобавитьТест("Тест_НовыйОбъект")
				.СПараметрами("Число")
				.СПараметрами("Строка")
				.СПараметрами("Массив")
				.СПараметрами("СписокЗначений")
				.СПараметрами("Структура")
				.СПараметрами("ДанныеФормыСтруктура")
	;

КонецПроцедуры

#Область Тесты

#Область НовыйОбъект

Процедура Тест_НовыйОбъект(ИмяТипа) Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	Тип = Тип(ИмяТипа);
	
	Результат = ТестируемыйМодуль.НовыйОбъект(ИмяТипа);
	ЮТест.ОжидаетЧто(Результат, "По имени типа").ИмеетТип(Тип);
	
	Результат = ТестируемыйМодуль.НовыйОбъект(Тип);
	ЮТест.ОжидаетЧто(Результат, "По типу").ИмеетТип(Тип);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль() Экспорт

	Возврат ЖЧТ_Модули.РаботаСТипамиКлиентСервер();
	
КонецФункции

#КонецОбласти