
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = ЖЧТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("ВставитьПараметрыВСтроку")
			.ДобавитьТест("Тест_ВставитьПараметрыВСтроку_ПараметрыВнутри", "Параметры внутри шаблона строки")
			.ДобавитьТест("Тест_ВставитьПараметрыВСтроку_ПараметрВНачале", "Параметр сразу в начале шаблона")
			.ДобавитьТест("Тест_ВставитьПараметрыВСтроку_ПараметрВКонце", "Параметр в конце шаблона")
			.ДобавитьТест("Тест_ВставитьПараметрыВСтроку_ТолькоПараметр", "В шаблоне только параметр")
			.ДобавитьТест("Тест_ВставитьПараметрыВСтроку_Ошибка_НетСвойства", "Ошибка, если нет свойства")
			.ДобавитьТест("Тест_ВставитьПараметрыВСтроку_Ошибка_НомерныеПараметры", "Ошибка, если передано %N")
			.ДобавитьТест("Тест_ВставитьПараметрыВСтроку_Ошибка_НеверныйФормат", "Ошибка, если передано %%")
	;

КонецПроцедуры

#Область Тесты

#Область ВставитьПараметрыВСтроку

Процедура Тест_ВставитьПараметрыВСтроку_ПараметрыВнутри() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	ШаблонСтроки = "Привет, %Фамилия% %Имя% %Отчество% !";
	ЗначенияСтроки = Новый Структура("Фамилия,Имя,Отчество", "Иванов", "Иван", "Иванович");
	
	Результат = ТестируемыйМодуль.ВставитьПараметрыВСтроку(ШаблонСтроки, ЗначенияСтроки);
	
	ЮТест.ОжидаетЧто(Результат).Равно("Привет, Иванов Иван Иванович !");
	
КонецПроцедуры

Процедура Тест_ВставитьПараметрыВСтроку_ПараметрВНачале() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	ШаблонСтроки = "%Свойство% = %Значение% !";
	ЗначенияСтроки = Новый Структура("Свойство,Значение", "Сумма", 100);

	Результат = ТестируемыйМодуль.ВставитьПараметрыВСтроку(ШаблонСтроки, ЗначенияСтроки);
	
	ЮТест.ОжидаетЧто(Результат).Равно("Сумма = 100 !");
	
КонецПроцедуры

Процедура Тест_ВставитьПараметрыВСтроку_ПараметрВКонце() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	ШаблонСтроки = "Мое значение: %Значение%";
	ЗначенияСтроки = Новый Структура("Значение", 1);

	Результат = ТестируемыйМодуль.ВставитьПараметрыВСтроку(ШаблонСтроки, ЗначенияСтроки);
	
	ЮТест.ОжидаетЧто(Результат).Равно("Мое значение: 1");
	
КонецПроцедуры

Процедура Тест_ВставитьПараметрыВСтроку_ТолькоПараметр() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	ШаблонСтроки = "%Значение%";
	ЗначенияСтроки = Новый Структура("Значение", 1);

	Результат = ТестируемыйМодуль.ВставитьПараметрыВСтроку(ШаблонСтроки, ЗначенияСтроки);
	
	ЮТест.ОжидаетЧто(Результат).Равно("1");
	
КонецПроцедуры

Процедура Тест_ВставитьПараметрыВСтроку_Ошибка_НетСвойства() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	ШаблонСтроки = "У меня нет %Свойство1% !";
	ЗначенияСтроки = Новый Структура("Свойство2");

	ИмяМетода = "ВставитьПараметрыВСтроку";
	ПараметрыМетода = ЖЧТ_Движок.ЮТОбщий().ЗначениеВМассиве(ШаблонСтроки, ЗначенияСтроки);
	
	ЮТест.ОжидаетЧто(ТестируемыйМодуль)
		.Метод(ИмяМетода, ПараметрыМетода)
		.ВыбрасываетИсключение("Поле объекта не обнаружено (Свойство1)");
	
КонецПроцедуры

Процедура Тест_ВставитьПараметрыВСтроку_Ошибка_НомерныеПараметры() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	ШаблонСтроки = "Текст с параметром %1!";
	ЗначенияСтроки = Новый Структура("С");

	ИмяМетода = "ВставитьПараметрыВСтроку";
	ПараметрыМетода = ЖЧТ_Движок.ЮТОбщий().ЗначениеВМассиве(ШаблонСтроки, ЗначенияСтроки);
	
	ЮТест.ОжидаетЧто(ТестируемыйМодуль)
		.Метод(ИмяМетода, ПараметрыМетода)
		.ВыбрасываетИсключение("Поле объекта не обнаружено (1!)");
	
КонецПроцедуры

Процедура Тест_ВставитьПараметрыВСтроку_Ошибка_НеверныйФормат() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	ШаблонСтроки = "Неверный формат %% !";
	ЗначенияСтроки = Новый Структура("С");

	ИмяМетода = "ВставитьПараметрыВСтроку";
	ПараметрыМетода = ЖЧТ_Движок.ЮТОбщий().ЗначениеВМассиве(ШаблонСтроки, ЗначенияСтроки);
	
	ЮТест.ОжидаетЧто(ТестируемыйМодуль)
		.Метод(ИмяМетода, ПараметрыМетода)
		.ВыбрасываетИсключение("Поле объекта не обнаружено");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль() Экспорт

	Возврат ЖЧТ_Модули.СтроковыеФункцииКлиентСервер();
	
КонецФункции

#КонецОбласти