// @strict-types

#Область ПрограммныйИнтерфейс

#Если Клиент Тогда

// Если форма открыта в другом окне, то процедура отключает автоматическое сохранение настроек списка
// Например, когда форма открывается из навигационной панели другой формы
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма списка
//  ИмяСписка - Строка - Имя списка. По умолчанию "Список"
//
Процедура ОтключитьСохранениеНастроекСпискаПриОткрытииВОкне(Форма, ИмяСписка = "Список") Экспорт
	
	Если НЕ Форма.Окно = Неопределено Тогда
		ЭлементСписка = Форма[ИмяСписка]; // ДинамическийСписок
		ЭлементСписка.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#Если НЕ ВебКлиент Тогда

// Структура из параметров формы.
// 
// Параметры:
//  ПараметрыФормы - ДанныеФормыСтруктура
// 
// Возвращаемое значение:
//  Структура
Функция СтруктураИзПараметровФормы(ПараметрыФормы) Экспорт
	
	Результат = Новый Структура;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ПараметрыФормы, НазначениеТипаXML.Явное);
	СтрокаXML = ЗаписьXML.Закрыть();
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.Имя = "structure" 
			И ЧтениеXML.ПолучитьАтрибут("name") = "parameters" 
			И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			Прервать;
			             
		ИначеЕсли ЧтениеXML.Имя = "field" Тогда
			
			ТекущийКлюч	= ЧтениеXML.ПолучитьАтрибут("nameRu");
			ТекущийКлюч	= ?(ЗначениеЗаполнено(ТекущийКлюч), ТекущийКлюч, ЧтениеXML.ПолучитьАтрибут("name"));
			Если ЗначениеЗаполнено(ТекущийКлюч) Тогда
				Результат.Вставить(ТекущийКлюч);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
	ЗаполнитьЗначенияСвойств(Результат, ПараметрыФормы);
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли

#КонецОбласти
