// @strict-types

#Область ПрограммныйИнтерфейс

// Устанавливает свойство объекта по его полному пути (с учетом подчиненных свойств).
// Источник: https://github.com/SeiOkami/CollectionMethodsOneS/issues/142
// 
// Параметры:
//  Объект - Произвольный - Любой объект, который имеет какие-то свойства
//  ПутьКСвойству - Строка - Полный путь к свойству
//  Значение - Произвольный - Устанавливаемое значение
//  
// Пример:
//	УстановитьСвойствоОбъекта(Объект, "Свойство.ПодчиненноеСвойство.ЕщеПодчиненное", Значение); 
//  
Процедура УстановитьСвойствоОбъекта(Знач Объект, Знач ПутьКСвойству, Знач Значение) Экспорт
	
	ЧастиПути = СтрРазделить(ПутьКСвойству, ".");
	ИндексГраницы = ЧастиПути.ВГраница();
	ТекущийОбъект = Объект;
	
	Для Индекс = 0 По ИндексГраницы - 1 Цикл
		ТекущийОбъект = ТекущийОбъект[ЧастиПути[Индекс]]; //Произвольный
	КонецЦикла;
	
	ТекущийОбъект[ЧастиПути[ИндексГраницы]] = Значение;
	
КонецПроцедуры

#КонецОбласти
