
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = ЖЧТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("СвернутьТабличнуюЧасть")
			.ДобавитьТест("Тест_СвернутьТабличнуюЧасть_БезРесурсов")
			.ДобавитьТест("Тест_СвернутьТабличнуюЧасть_ОдинРесурс")
			.ДобавитьТест("Тест_СвернутьТабличнуюЧасть_НесколькоРесурсов")
			.ДобавитьТест("СвернутьТабличнуюЧасть_БезИзмерений")
	;

КонецПроцедуры

#Область Тесты

#Область СвернутьТабличнуюЧасть

Процедура Тест_СвернутьТабличнуюЧасть_БезРесурсов() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	Эталон = Обработки.ЖЧТ_ОбработкаТестирования.Создать().СвернутьТабличнуюЧасть_БезРесурсов;
	Эталон.Добавить();
	
	Параметр = Обработки.ЖЧТ_ОбработкаТестирования.Создать().СвернутьТабличнуюЧасть_БезРесурсов;
	Параметр.Добавить();
	Параметр.Добавить();
	Параметр.Добавить();
	
	ТестируемыйМодуль.СвернутьТабличнуюЧасть(Параметр);
	
	ЮТест.ОжидаетЧто(Параметр.Выгрузить()).Равно(Эталон.Выгрузить());
	
КонецПроцедуры

Процедура Тест_СвернутьТабличнуюЧасть_ОдинРесурс() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	Эталон = Обработки.ЖЧТ_ОбработкаТестирования.Создать().СвернутьТабличнуюЧасть_ОдинРесурс;
	
	Строка = Эталон.Добавить();
	Строка.Измерение1 = 1;
	Строка.Ресурс1 = 3;
	
	Строка = Эталон.Добавить();
	Строка.Измерение2 = 1;
	Строка.Ресурс1 = 1;
	
	Параметр = Обработки.ЖЧТ_ОбработкаТестирования.Создать().СвернутьТабличнуюЧасть_ОдинРесурс;
	
	Строка = Параметр.Добавить();
	Строка.Измерение1 = 1;
	Строка.Ресурс1 = 1;
	
	Строка = Параметр.Добавить();
	Строка.Измерение2 = 1;
	Строка.Ресурс1 = 1;
	
	Строка = Параметр.Добавить();
	Строка.Измерение1 = 1;
	Строка.Ресурс1 = 2;
	
	ТестируемыйМодуль.СвернутьТабличнуюЧасть(Параметр);
	
	ЮТест.ОжидаетЧто(Параметр.Выгрузить()).Равно(Эталон.Выгрузить());
	
КонецПроцедуры

Процедура Тест_СвернутьТабличнуюЧасть_НесколькоРесурсов() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	Эталон = Обработки.ЖЧТ_ОбработкаТестирования.Создать().СвернутьТабличнуюЧасть_НесколькоРесурсов;
	
	Строка = Эталон.Добавить();
	Строка.Измерение1 = 1;
	Строка.Ресурс1 = 5;
	
	Строка = Эталон.Добавить();
	Строка.Измерение2 = 1;
	Строка.Ресурс2 = 10;
	
	Строка = Эталон.Добавить();
	
	Параметр = Обработки.ЖЧТ_ОбработкаТестирования.Создать().СвернутьТабличнуюЧасть_НесколькоРесурсов;
	
	Строка = Параметр.Добавить();
	Строка.Измерение1 = 1;
	Строка.Ресурс1 = 3;
	
	Строка = Параметр.Добавить();
	Строка.Измерение1 = 1;
	Строка.Ресурс1 = 2;
	
	Строка = Параметр.Добавить();
	Строка.Измерение2 = 1;
	Строка.Ресурс2 = 1;
	
	Строка = Параметр.Добавить();
	Строка.Измерение2 = 1;
	Строка.Ресурс2 = 9;
	
	Строка = Параметр.Добавить();
	
	ТестируемыйМодуль.СвернутьТабличнуюЧасть(Параметр);
	
	ЮТест.ОжидаетЧто(Параметр.Выгрузить()).Равно(Эталон.Выгрузить());
	
КонецПроцедуры

Процедура СвернутьТабличнуюЧасть_БезИзмерений() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	Эталон = Обработки.ЖЧТ_ОбработкаТестирования.Создать().СвернутьТабличнуюЧасть_БезИзмерений;
	Строка = Эталон.Добавить();
	Строка.Ресурс1 = 3;
	Строка.Ресурс2 = 7;
	Строка.Ресурс3 = 11;
	
	Параметр = Обработки.ЖЧТ_ОбработкаТестирования.Создать().СвернутьТабличнуюЧасть_БезИзмерений;
	Параметр.Добавить().Ресурс1 = 1;
	Параметр.Добавить().Ресурс1 = 2;
	Параметр.Добавить().Ресурс2 = 3;
	Параметр.Добавить().Ресурс2 = 4;
	Параметр.Добавить().Ресурс3 = 5;
	Параметр.Добавить().Ресурс3 = 6;
	
	ТестируемыйМодуль.СвернутьТабличнуюЧасть(Параметр);
	
	ЮТест.ОжидаетЧто(Параметр.Выгрузить()).Равно(Эталон.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль() Экспорт

	Возврат ЖЧТ_Модули.РаботаСКоллекциями();
	
КонецФункции

#КонецОбласти
