
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = ЖЧТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("УстановитьКоличествоПолучаемыхЗаписейНабораДанных")
			.ДобавитьТест("Тест_УстановитьКоличествоПолучаемыхЗаписейНабораДанных_Успешно")
		.ДобавитьТестовыйНабор("НовыйКомпоновщикНастроек")
			.ДобавитьТест("Тест_НовыйКомпоновщикНастроек")
		.ДобавитьТестовыйНабор("ПолеКомпоновкиДанных")
			.ДобавитьТест("Тест_ПолеКомпоновкиДанных")
				.СПараметрами("Тест.Овое.Поле")
				.СПараметрами(Новый ПолеКомпоновкиДанных("Тест.Овое.Поле"))
				.СПараметрами(ЖЧТ_Модули.РаботаСТипамиКлиентСервер().НовыйОбъект("ПользовательскоеПолеВыборКомпоновкиДанных"))
				.СПараметрами(ЖЧТ_Модули.РаботаСТипамиКлиентСервер().НовыйОбъект("ПользовательскоеПолеВыражениеКомпоновкиДанных"))
		.ДобавитьТестовыйНабор("НовыйСКД")
			.ДобавитьТест("Тест_НовыйСКД")
	;

КонецПроцедуры

#Область Тесты

#Область УстановитьКоличествоПолучаемыхЗаписейНабораДанных

Процедура Тест_УстановитьКоличествоПолучаемыхЗаписейНабораДанных_Успешно() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	СКД = Новый СхемаКомпоновкиДанных();
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Запрос = "ВЫБРАТЬ 1 КАК Поле ПОМЕСТИТЬ ВТ; ВЫБРАТЬ Поле ИЗ ВТ";
	
	ОжидаемыйТекст = ЖЧТ_Модули.РаботаСЗапросами().ОтформатированныйТекстЗапроса(
		"ВЫБРАТЬ 1 КАК Поле ПОМЕСТИТЬ ВТ; ВЫБРАТЬ ПЕРВЫЕ 9 Поле ИЗ ВТ");
	
	ТестируемыйМодуль.УстановитьКоличествоПолучаемыхЗаписейНабораДанных(НаборДанных, 9);
	
	ЮТест.ОжидаетЧто(НаборДанных.Запрос).Равно(ОжидаемыйТекст);
	
КонецПроцедуры

#КонецОбласти

#Область НовыйКомпоновщикНастроек

Процедура Тест_НовыйКомпоновщикНастроек() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	СКД = Новый СхемаКомпоновкиДанных();
	Параметр = СКД.Параметры.Добавить();
	Параметр.Имя = "Тест";
	
	КомпоновщикНастроек = ТестируемыйМодуль.НовыйКомпоновщикНастроек(СКД); // КомпоновщикНастроекКомпоновкиДанных
	
	ЮТест.ОжидаетЧто(КомпоновщикНастроек)
		.ИмеетТип("КомпоновщикНастроекКомпоновкиДанных")
		.Свойство("Настройки.ДоступныеПоляВыбора.Элементы[1].Элементы[0].Поле")
		.Равно(Новый ПолеКомпоновкиДанных("ПараметрыДанных.Тест"));
	
	
КонецПроцедуры

#КонецОбласти

#Область ПолеКомпоновкиДанных

Процедура Тест_ПолеКомпоновкиДанных(Источник, Знач ПутьКДанным = Неопределено) Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	Если ПутьКДанным = Неопределено Тогда
		ПутьКДанным = Строка(Источник);
	КонецЕсли;
	
	Ожидание  = Новый ПолеКомпоновкиДанных(ПутьКДанным);
	
	Результат = ТестируемыйМодуль.ПолеКомпоновкиДанных(Источник);
	
	ЮТест.ОжидаетЧто(Результат)
		.ИмеетТип("ПолеКомпоновкиДанных")
		.Равно(Ожидание);
	
КонецПроцедуры

#КонецОбласти

#Область НовыйСКД

Процедура Тест_НовыйСКД() Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();

	ТестируемыйМодуль = ТестируемыйМодуль();
	
	Результат = ТестируемыйМодуль.НовыйСКД();
	
	ЮТест.ОжидаетЧто(Результат)
		.ИмеетТип("СхемаКомпоновкиДанных")
		.Свойство("ИсточникиДанных[0].ТипИсточникаДанных").Равно("Local");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль() Экспорт

	Возврат ЖЧТ_Модули.РаботаСоСхемойКомпоновкиДанных();
	
КонецФункции

#КонецОбласти
