// @strict-types

#Область ПрограммныйИнтерфейс

// Заменяет в строке именованные параметры на значения свойств объекта (по формату %ИмяСвойства%)
// 
// Параметры:
//  ШаблонСтроки - Строка - Строка, в которую необходимо всавить свойства объекта
//  Объект - Произвольный - Произвольный объект, свойства которого необходимо вставить в строку
// 
// Возвращаемое значение:
//  Строка
Функция ВставитьПараметрыВСтроку(ШаблонСтроки, Объект) Экспорт
	
	Разделитель = "%";
	ЭтоПараметр = Ложь;
	ЧастиСтроки = СтрРазделить(ШаблонСтроки, Разделитель, Истина);
	Для Индекс = 0 По ЧастиСтроки.Количество() - 1 Цикл
		
		Если ЭтоПараметр Тогда
			ИмяСвойства = ЧастиСтроки[Индекс];
			ЧастиСтроки[Индекс] = Строка(Объект[ИмяСвойства]);
			ЭтоПараметр = Ложь;
		Иначе
			ЭтоПараметр = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(ЧастиСтроки, "");
	
КонецФункции

#КонецОбласти

