// @strict-types

#Область ПрограммныйИнтерфейс

// Заменяет в строке именованные параметры на значения свойств объекта (по формату %ИмяСвойства%)
// 
// Параметры:
//  ШаблонСтроки - Строка - Строка, в которую необходимо всавить свойства объекта
//  Объект - Произвольный - Произвольный объект, свойства которого необходимо вставить в строку
// 
// Возвращаемое значение:
//  Строка
Функция ВставитьПараметрыВСтроку(ШаблонСтроки, Объект) Экспорт
	
	Разделитель = "%";
	ЭтоПараметр = Ложь;
	ЧастиСтроки = СтрРазделить(ШаблонСтроки, Разделитель, Истина);
	Для Индекс = 0 По ЧастиСтроки.Количество() - 1 Цикл
		
		Если ЭтоПараметр Тогда
			ИмяСвойства = ЧастиСтроки[Индекс];
			ЧастиСтроки[Индекс] = Строка(Объект[ИмяСвойства]);
			ЭтоПараметр = Ложь;
		Иначе
			ЭтоПараметр = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(ЧастиСтроки, "");
	
КонецФункции

// Возвращает форматированную строку, в которой части выделены.
// Например, "Выдели `слово` в предложении"
// 
// Параметры:
//  Строка - Строка
//  Выделитель - Строка - Символ, который обрамляет выделяемую строку
// 
// Возвращаемое значение:
//  Строка
Функция СтрокаВыделеннаяОформлением(Строка, Выделитель = "`") Экспорт
	
	ЭтоВыделить = Ложь;
	ЧастиСтроки = СтрРазделить(Строка, Выделитель, Истина);
	Для Индекс = 0 По ЧастиСтроки.Количество() - 1 Цикл
		
		Если ЭтоВыделить Тогда
			ЧастьСтроки = ЧастиСтроки[Индекс];
			ЧастьСтроки = СтрНайтиИВыделитьОформлением(ЧастьСтроки, ЧастьСтроки);
			ЧастиСтроки[Индекс] = ЧастьСтроки;
			ЭтоВыделить = Ложь;
		Иначе
			ЭтоВыделить = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецФункции

// Метод выделяет подстроку внутри подстроки с использованием метода см. СтрНайтиИВыделитьОформлением
// 
// Параметры:
//  Строка - Строка - Исходная строка
//  Подстрока - Строка - Искомая строка
// 
// Возвращаемое значение:
//  ФорматированнаяСтрока, Неопределено - вернет форматированную строку, если хотя бы одно вхождение найдено
Функция СтрокаНайтиИВыделитьОформлением(Строка, Подстрока) Экспорт

	СтрокаВрег = ВРег(Строка);
	ПодстрокаВрег = ВРег(Подстрока);

	ДлинаСтроки = СтрДлина(Строка);
	ДлинаПодстроки = СтрДлина(Подстрока);

	ЧастиРезультата = Новый Массив; // Массив из Строка, ФорматированнаяСтрока

	НачалоПоиска = 1;
	Пока НачалоПоиска <= ДлинаСтроки Цикл

		ТекущаяКоордината = СтрНайти(СтрокаВрег, ПодстрокаВрег, , НачалоПоиска);
		Если ТекущаяКоордината = 0 Тогда

			Если ЗначениеЗаполнено(ЧастиРезультата) Тогда
				ЧастьСтроки = Сред(Строка, НачалоПоиска);
				ЧастиРезультата.Добавить(ЧастьСтроки);
				Прервать;
			Иначе
				Возврат Неопределено;
			КонецЕсли;

		Иначе

			Если НачалоПоиска < ТекущаяКоордината Тогда
				ЧастьСтроки = Сред(Строка, НачалоПоиска, ТекущаяКоордината - НачалоПоиска);
				ЧастиРезультата.Добавить(ЧастьСтроки);
			КонецЕсли;

			ЧастьСтроки = Сред(Строка, ТекущаяКоордината, ДлинаПодстроки);
			ЧастьСтроки = СтрНайтиИВыделитьОформлением(ЧастьСтроки, Подстрока);
			ЧастиРезультата.Добавить(ЧастьСтроки);

			НачалоПоиска = ТекущаяКоордината + ДлинаПодстроки;

		КонецЕсли;
		
	КонецЦикла;

	Возврат Новый ФорматированнаяСтрока(ЧастиРезультата);

КонецФункции

#КонецОбласти
