
#Область СлужебныйПрограммныйИнтерфейс

// Регистрация тестов
Процедура ИсполняемыеСценарии() Экспорт

	Перем ЮТТесты;
	ЮТТесты = ЖЧТ_Движок.ЮТТесты();
	
	ЮТТесты
		.ДобавитьТестовыйНабор("СколькоПроцентовЧислоОтЧисла")
			.ДобавитьТест("Тест_СколькоПроцентовЧислоОтЧисла")
				.СПараметрами(10 ,   0, 0, 0)
				.СПараметрами(10 , 100, 0, 10)
				.СПараметрами( 9 ,  69, 2, 13.04)
				.СПараметрами( 9 ,  69, 3, 13.043)
				.СПараметрами(-1 ,  10, 0, -10)
	;

КонецПроцедуры

#Область Тесты

#Область СколькоПроцентовЧислоОтЧисла

Процедура Тест_СколькоПроцентовЧислоОтЧисла(
	Число, ОтЧисла, ОкруглятьДо, ОжидаемыйРезультат) Экспорт

	Перем ЮТест;
	ЮТест = ЖЧТ_Движок.ЮТест();
	Модуль = ТестируемыйМодуль();
	
	Результат = Модуль.СколькоПроцентовЧислоОтЧисла(Число, ОтЧисла, ОкруглятьДо);
	
	ЮТест.ОжидаетЧто(Результат).Равно(ОжидаемыйРезультат);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Тестируемый модуль.
// 
// Возвращаемое значение:
//  ОбщийМодуль
Функция ТестируемыйМодуль() Экспорт

	Возврат ЖЧТ_Модули.МатематическиеМетоды();
	
КонецФункции

#КонецОбласти
