
#Область ПрограммныйИнтерфейс

Функция СтроковыеФункции() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_СтроковыеФункции");
	
КонецФункции

Функция РаботаСТипами() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_РаботаСТипами");
	
КонецФункции

Функция РаботаСФормами() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_РаботаСФормами");
	
КонецФункции

Функция ОбщегоНазначения() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_ОбщегоНазначения");
	
КонецФункции

#Если Сервер Тогда

Функция РаботаСЗапросами() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_РаботаСЗапросами");
	
КонецФункции

Функция РаботаСКоллекциями() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_РаботаСКоллекциями");
	
КонецФункции

Функция РаботаСДанными() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_РаботаСДанными");
	
КонецФункции

Функция РаботаСоСхемойКомпоновкиДанных() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_РаботаСоСхемойКомпоновкиДанных");
	
КонецФункции

#КонецЕсли

#КонецОбласти
