
#Область ПрограммныйИнтерфейс

Функция СтроковыеФункцииКлиентСервер() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_СтроковыеФункцииКлиентСервер");
	
КонецФункции

Функция РаботаСТипамиКлиентСервер() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_РаботаСТипамиКлиентСервер");
	
КонецФункции

#Если Сервер Тогда

Функция РаботаСЗапросами() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_РаботаСЗапросами");
	
КонецФункции

Функция РаботаСКоллекциями() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_РаботаСКоллекциями");
	
КонецФункции

Функция РаботаСДанными() Экспорт
	
	Возврат ЖЧТ_Движок.ОбщийМодуль("ЖЧ_РаботаСДанными");
	
КонецФункции

#КонецЕсли

#КонецОбласти
